---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShapeDefinition.GetParameters
source: html/619c0dac-a7f6-5e57-54b2-76370da248f9.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeDefinition.GetParameters Method

Return the Ids of the shared parameters in the Definition.

## Syntax (C#)
```csharp
public IList<ElementId> GetParameters()
```

## Returns
List of parameters as ElementIds.